# ICS 434: DATA SCIENCE FUNDAMENTALS

## Data Wrangling: Joining, Combining and Reshaping Data 

---

* This chapter focuces on the tools you need to combine, join and rearrange data

# ICS 434: DATA SCIENCE FUNDAMENTALS

## Data Wrangling: Joining and Combining Data 

---

In [3]:
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt

from IPython.display import Image

In [4]:
np.random.seed(12345)
pd.options.display.max_rows = 20
plt.rc('figure', figsize=(10, 6))

### Combining and Merging Datasets

* You can combine `DataFrames` using different strategies
 * You can achieve similar effect as `join` in SQL
 * You can also concatenate `DataFrames` horizontally or vertically
 
* The operation we will cover and use are
  - `merge()`: connect rows in `DataFrames` based on keys (similar to database `Join` operation)
  - `concat()`: concatenate data (horizontally) or stacks it (vertically)

In [3]:
df1 = pd.DataFrame({'key': ['b', 'b', 'a', 'c', 'a', 'a', 'b'], 'data1': range(7)})
df1

  key  data1
0   b      0
1   b      1
2   a      2
3   c      3
4   a      4
5   a      5
6   b      6

In [4]:
df2 = pd.DataFrame({'key': ['a', 'b', 'd'], 'data2': range(3)})
df2

  key  data2
0   a      0
1   b      1
2   d      2

### Database-Style DataFrame Joins

* Merge on a common `keys`

* We can merge `df1` and `df2` on the common column name `key`  
  * Pandas can infer the overlapping `key`, or you can specify it explicitly using `on=` 
  * Using `on=` avoids mistakes in large dataset with dozens of columns
* Since some labels are duplicated in `df1` while `df2` has a single row for `key` value, this amount to a `many-to-one` join

In [5]:
merged_df = pd.merge(df1, df2)
merged_df

  key  data1  data2
0   b      0      1
1   b      1      1
2   b      6      1
3   a      2      0
4   a      4      0
5   a      5      0

In [6]:
merged_df = pd.merge(df1, df2, on='key')
merged_df

  key  data1  data2
0   b      0      1
1   b      1      1
2   b      6      1
3   a      2      0
4   a      4      0
5   a      5      0

In [7]:
merged_df.sort_values("key")

  key  data1  data2
3   a      2      0
4   a      4      0
5   a      5      0
0   b      0      1
1   b      1      1
2   b      6      1

- If the columns are different in both datasets, you can specify them separately using `left_on=` and `right_on=`

In [8]:
df3 = pd.DataFrame({'lkey': ['b', 'b', 'a', 'c', 'a', 'a', 'b'],
                    'data1': range(7)})
df4 = pd.DataFrame({'rkey': ['a', 'b', 'd'],
                    'data2': range(3)})
display(df3)
display(df4)
merged_df = pd.merge(df3, df4, left_on='lkey', right_on='rkey')
merged_df[["lkey", "rkey", "data1", "data2"]]

  lkey  data1
0    b      0
1    b      1
2    a      2
3    c      3
4    a      4
5    a      5
6    b      6

  rkey  data2
0    a      0
1    b      1
2    d      2

  lkey rkey  data1  data2
0    b    b      0      1
1    b    b      1      1
2    b    b      6      1
3    a    a      2      0
4    a    a      4      0
5    a    a      5      0

### Unmatches Values

![](https://www.dropbox.com/s/u0wuwrpk8vga60h/missing_keys.png?dl=1)

* What happened to lkey=`c`   and rkey=`d`? Why aren't they showing in the resulting `DataFrame`?
  * Unmatched keys are dropped from the merged result

### Merge Types

* By default, the merge does an `inner` join

* Different merge types in `pandas.merge()`

| Option        | Behavior           |
| ------------- |:------------- | 
| `inner`      | Use set of keys present in both frames (intersection) | 
| `left`      | Use keys found in left frame      | 
| `right` | Use keys found in right frame      | 
| `outer` | Use the union of keys found in left and right frames      |

In [9]:
pd.merge(df1, df2, on='key', how='outer')

  key  data1  data2
0   b    0.0    1.0
1   b    1.0    1.0
2   b    6.0    1.0
3   a    2.0    0.0
4   a    4.0    0.0
5   a    5.0    0.0
6   c    3.0    NaN
7   d    NaN    2.0

In [5]:
df1 = pd.DataFrame({'key': ['b', 'b', 'a', 'c', 'a', 'b'],
                    'data1': range(6)})
df1

  key  data1
0   b      0
1   b      1
2   a      2
3   c      3
4   a      4
5   b      5

In [6]:
df2 = pd.DataFrame({'key': ['a', 'b', 'a', 'b', 'd'],
                    'data2': range(5)})
df2

  key  data2
0   a      0
1   b      1
2   a      2
3   b      3
4   d      4

In [7]:
df1.shape,  df1.shape

((6, 2), (6, 2))

In [12]:
# many-to-many merge

pd.merge(df1, df2, on='key', how='left')

   key  data1  data2
0    b      0    1.0
1    b      0    3.0
2    b      1    1.0
3    b      1    3.0
4    a      2    0.0
5    a      2    2.0
6    c      3    NaN
7    a      4    0.0
8    a      4    2.0
9    b      5    1.0
10   b      5    3.0

In [13]:
pd.merge(df1, df2, how='inner')

  key  data1  data2
0   b      0      1
1   b      0      3
2   b      1      1
3   b      1      3
4   b      5      1
5   b      5      3
6   a      2      0
7   a      2      2
8   a      4      0
9   a      4      2

In [14]:
pd.merge(df1, df2, how='cross').head(30)

   key_x  data1 key_y  data2
0      b      0     a      0
1      b      0     b      1
2      b      0     a      2
3      b      0     b      3
4      b      0     d      4
..   ...    ...   ...    ...
25     b      5     a      0
26     b      5     b      1
27     b      5     a      2
28     b      5     b      3
29     b      5     d      4

[30 rows x 4 columns]

In [15]:
left = pd.DataFrame({'key1': ['foo', 'foo', 'bar'],
                     'key2': ['one', 'two', 'one'],
                     'lval': [1, 2, 3]})
left

  key1 key2  lval
0  foo  one     1
1  foo  two     2
2  bar  one     3

In [16]:
right = pd.DataFrame({'key1': ['foo', 'foo', 'bar', 'bar'],
                      'key2': ['one', 'one', 'one', 'two'],
                      'rval': [4, 5, 6, 7]})
right

  key1 key2  rval
0  foo  one     4
1  foo  one     5
2  bar  one     6
3  bar  two     7

In [17]:
# merge with multiple keys

pd.merge(left, right, on=['key1', 'key2'], how='outer')

  key1 key2  lval  rval
0  foo  one   1.0   4.0
1  foo  one   1.0   5.0
2  foo  two   2.0   NaN
3  bar  one   3.0   6.0
4  bar  two   NaN   7.0

### Avoid Column Collision

<img src="images/tables.png">

* Pandas renames similar columns to avoid ambiguity
* When `merge()` creates ambiguity, `pandas` renames identical columns across tables, adding suffix `_x` to the left frame and `_y` to the right frame by default

### Avoid Column Collision

<img src="images/tables.png">

* When `merge()` creates ambiguity, pandas renames identical columns across tables, adding suffix `_x` to the left frame and `_y` to the right frame by default

In [18]:
pd.merge(left, right, on='key1')

  key1 key2_x  lval key2_y  rval
0  foo    one     1    one     4
1  foo    one     1    one     5
2  foo    two     2    one     4
3  foo    two     2    one     5
4  bar    one     3    one     6
5  bar    one     3    two     7

In [19]:
pd.merge(left, right, on='key1', suffixes=('_left', '_right'))

  key1 key2_left  lval key2_right  rval
0  foo       one     1        one     4
1  foo       one     1        one     5
2  foo       two     2        one     4
3  foo       two     2        one     5
4  bar       one     3        one     6
5  bar       one     3        two     7

### Merging on Index

* Merging on the index is also very common
* Merge on one or more indexes with hierarchical keys operates the same way as a merge on multiple columns

In [20]:
left1 = pd.DataFrame({'key': ['a', 'b', 'a', 'a', 'b', 'c'],
                      'value': range(6)})
left1

  key  value
0   a      0
1   b      1
2   a      2
3   a      3
4   b      4
5   c      5

In [21]:
right1 = pd.DataFrame({'group_val': [3.5, 7]}, index=['a', 'b'])
right1

   group_val
a        3.5
b        7.0

In [22]:
pd.merge(left1, right1, left_on='key', right_index=True)

  key  value  group_val
0   a      0        3.5
2   a      2        3.5
3   a      3        3.5
1   b      1        7.0
4   b      4        7.0

In [23]:
pd.merge(left1, right1, left_on='key', right_index=True, how='outer')

  key  value  group_val
0   a      0        3.5
2   a      2        3.5
3   a      3        3.5
1   b      1        7.0
4   b      4        7.0
5   c      5        NaN

In [24]:
left_hierarchial = pd.DataFrame({'key1': ['Ohio', 'Ohio', 'Ohio', 'Nevada', 'Nevada'],
                                 'key2': [2000, 2001, 2002, 2001, 2002],
                                 'data': np.arange(5.)})
left_hierarchial

     key1  key2  data
0    Ohio  2000   0.0
1    Ohio  2001   1.0
2    Ohio  2002   2.0
3  Nevada  2001   3.0
4  Nevada  2002   4.0

In [25]:
right_hierarchial = pd.DataFrame(np.arange(12).reshape((6, 2)),
                                 index=[['Nevada', 'Nevada', 'Ohio', 'Ohio','Ohio', 'Ohio'],
                                        [2001, 2000, 2000, 2000, 2001, 2002]],
                                 columns=['event1', 'event2'])
right_hierarchial

             event1  event2
Nevada 2001       0       1
       2000       2       3
Ohio   2000       4       5
       2000       6       7
       2001       8       9
       2002      10      11

In [26]:
pd.merge(left_hierarchial, right_hierarchial, left_on=['key1', 'key2'], right_index=True)

     key1  key2  data  event1  event2
0    Ohio  2000   0.0       4       5
0    Ohio  2000   0.0       6       7
1    Ohio  2001   1.0       8       9
2    Ohio  2002   2.0      10      11
3  Nevada  2001   3.0       0       1

In [27]:
pd.merge(left_hierarchial, right_hierarchial, left_on=['key1', 'key2'],
         right_index=True, how='outer')

     key1  key2  data  event1  event2
0    Ohio  2000   0.0     4.0     5.0
0    Ohio  2000   0.0     6.0     7.0
1    Ohio  2001   1.0     8.0     9.0
2    Ohio  2002   2.0    10.0    11.0
3  Nevada  2001   3.0     0.0     1.0
4  Nevada  2002   4.0     NaN     NaN
4  Nevada  2000   NaN     2.0     3.0

In [28]:
left2 = pd.DataFrame([[1., 2.], [3., 4.], [5., 6.]],
                     index=['a', 'c', 'e'],
                     columns=['Ohio', 'Nevada'])
left2

   Ohio  Nevada
a   1.0     2.0
c   3.0     4.0
e   5.0     6.0

In [29]:
right2 = pd.DataFrame([[7., 8.], [9., 10.], [11., 12.], [13, 14]],
                      index=['b', 'c', 'd', 'e'],
                      columns=['Missouri', 'Alabama'])
right2

   Missouri  Alabama
b       7.0      8.0
c       9.0     10.0
d      11.0     12.0
e      13.0     14.0

In [30]:
pd.merge(left2, right2, how='outer', left_index=True, right_index=True)

   Ohio  Nevada  Missouri  Alabama
a   1.0     2.0       NaN      NaN
b   NaN     NaN       7.0      8.0
c   3.0     4.0       9.0     10.0
d   NaN     NaN      11.0     12.0
e   5.0     6.0      13.0     14.0

### Concatenating Along an Axis

- Also known as binding or stacking
- By default, concatenation 
  - operates on `axis=0`
  - uses `join=outer`

In [31]:
arr = np.arange(12).reshape((3, 4))
arr

array([[ 0,  1,  2,  3],
       [ 4,  5,  6,  7],
       [ 8,  9, 10, 11]])

In [32]:
np.concatenate([arr, arr])

array([[ 0,  1,  2,  3],
       [ 4,  5,  6,  7],
       [ 8,  9, 10, 11],
       [ 0,  1,  2,  3],
       [ 4,  5,  6,  7],
       [ 8,  9, 10, 11]])

In [33]:
np.concatenate([arr, arr], axis=1)

array([[ 0,  1,  2,  3,  0,  1,  2,  3],
       [ 4,  5,  6,  7,  4,  5,  6,  7],
       [ 8,  9, 10, 11,  8,  9, 10, 11]])

In [34]:
s1 = pd.Series([0, 1], index=['a', 'b'])
s2 = pd.Series([2, 3, 4], index=['c', 'd', 'e'])
s3 = pd.Series([5, 6], index=['f', 'g'])

print(s1)

print("*" * 10)
print(s2)

print("*" * 10)
print(s3)

a    0
b    1
dtype: int64
**********
c    2
d    3
e    4
dtype: int64
**********
f    5
g    6
dtype: int64

In [35]:
pd.concat([s1, s2, s3])

a    0
b    1
c    2
d    3
e    4
f    5
g    6
dtype: int64

In [36]:
pd.concat([s1, s2, s3], axis=1)

     0    1    2
a  0.0  NaN  NaN
b  1.0  NaN  NaN
c  NaN  2.0  NaN
d  NaN  3.0  NaN
e  NaN  4.0  NaN
f  NaN  NaN  5.0
g  NaN  NaN  6.0

In [37]:
print(s1)
print("*" * 10)
print(s3)

s4 = pd.concat([s1, s3])
s4

a    0
b    1
dtype: int64
**********
f    5
g    6
dtype: int64

a    0
b    1
f    5
g    6
dtype: int64

In [38]:
print(pd.concat([s1, s4], axis=1))
print("*" * 10)
print(pd.concat([s1, s4], axis=1, join='inner'))

     0  1
a  0.0  0
b  1.0  1
f  NaN  5
g  NaN  6
**********
   0  1
a  0  0
b  1  1

### Creating Indexes by Concatenation

* Concatenation is useful for creating a hierarchical index of the data
  * Use `keys=` pamareter of the same size as the array objects to concatenate
  * If `axis=1`, `keys` become the column (header) names when concatenating `Series`
  * If `axis=1`, `keys` are the level names when concatenating `DataFrames`

In [39]:
display(s1)
display(s2)
display(s3)

a    0
b    1
dtype: int64

c    2
d    3
e    4
dtype: int64

f    5
g    6
dtype: int64

In [40]:
result = pd.concat([s1, s2, s3], keys=['patient_1', 'patient_2', 'patient_3'])
result

patient_1  a    0
           b    1
patient_2  c    2
           d    3
           e    4
patient_3  f    5
           g    6
dtype: int64

In [41]:
result.unstack()

             a    b    c    d    e    f    g
patient_1  0.0  1.0  NaN  NaN  NaN  NaN  NaN
patient_2  NaN  NaN  2.0  3.0  4.0  NaN  NaN
patient_3  NaN  NaN  NaN  NaN  NaN  5.0  6.0

In [42]:
pd.concat([s1, s2, s3], axis=1, keys=['COL_1', 'COL_2', 'COL_3'])

   COL_1  COL_2  COL_3
a    0.0    NaN    NaN
b    1.0    NaN    NaN
c    NaN    2.0    NaN
d    NaN    3.0    NaN
e    NaN    4.0    NaN
f    NaN    NaN    5.0
g    NaN    NaN    6.0

In [43]:
df1 = pd.DataFrame(np.arange(6).reshape(3, 2), index=['a', 'b', 'c'], columns=['one', 'two'])
df2 = pd.DataFrame(5 + np.arange(4).reshape(2, 2), index=['a', 'c'], columns=['three', 'four'])

display(df1)
display(df2)

   one  two
a    0    1
b    2    3
c    4    5

   three  four
a      5     6
c      7     8

In [44]:
pd.concat([df1, df2], axis=1, keys=['level1', 'level2'])

  level1     level2
     one two  three four
a      0   1    5.0  6.0
b      2   3    NaN  NaN
c      4   5    7.0  8.0

In [45]:
pd.concat({'level1': df1, 'level2': df2}, axis=1)

  level1     level2
     one two  three four
a      0   1    5.0  6.0
b      2   3    NaN  NaN
c      4   5    7.0  8.0

In [46]:
df1 = pd.DataFrame(np.random.randn(3, 4), columns=['a', 'b', 'c', 'd'])
df2 = pd.DataFrame(np.random.randn(2, 3), columns=['b', 'd', 'a'])

display(df1)
display(df2)

          a         b         c         d
0 -0.204708  0.478943 -0.519439 -0.555730
1  1.965781  1.393406  0.092908  0.281746
2  0.769023  1.246435  1.007189 -1.296221

          b         d         a
0  0.274992  0.228913  1.352917
1  0.886429 -2.001637 -0.371843

In [47]:
pd.concat([df1, df2], ignore_index=True)

          a         b         c         d
0 -0.204708  0.478943 -0.519439 -0.555730
1  1.965781  1.393406  0.092908  0.281746
2  0.769023  1.246435  1.007189 -1.296221
3  1.352917  0.274992       NaN  0.228913
4 -0.371843  0.886429       NaN -2.001637

In [48]:
pd.concat([df1, df2])

          a         b         c         d
0 -0.204708  0.478943 -0.519439 -0.555730
1  1.965781  1.393406  0.092908  0.281746
2  0.769023  1.246435  1.007189 -1.296221
0  1.352917  0.274992       NaN  0.228913
1 -0.371843  0.886429       NaN -2.001637

- See the `Table 8.3` in *Python for Data Analysis* for other useful `concat()` arguments.

### Combining Data with Overlap

- `combine_first` is a useful function for combining data using a method that is similar to numpy's `where`
  - Test some condition, if true take first value, else take second value

In [49]:
a = pd.Series([np.nan, 2.5, np.nan, 3.5, 4.5, np.nan],
              index=['f', 'e', 'd', 'c', 'b', 'a'])
b = pd.Series(np.arange(len(a), dtype=np.float64),
              index=['a', 'b', 'c', 'd', 'e', 'f'])
b[-1] = np.nan

display(a)
display(b)

f    NaN
e    2.5
d    NaN
c    3.5
b    4.5
a    NaN
dtype: float64

a    0.0
b    1.0
c    2.0
d    3.0
e    4.0
f    NaN
dtype: float64

In [50]:
np.where(pd.isna(a), b, a)

array([0. , 2.5, 2. , 3.5, 4.5, nan])

#### Using `numpy.where` doesn't check whether the index labels are aligned or not, and doesn't even require the objects to be the same length. So, if you want to line up values by index, use the Series `combine_first` method.

In [51]:
a.combine_first(b)

a    0.0
b    4.5
c    3.5
d    3.0
e    2.5
f    NaN
dtype: float64

#### With DataFrames, `combine_first` does the same thing *column by column*, so you can think of it as "patching" missing data in the calling object with data from object you pass.

#### The output of `combine_first` with DataFrame objects will have the *union* of all the column names.

In [52]:
df1 = pd.DataFrame({'a': [1., np.nan, 5., np.nan], 
                    'b': [np.nan, 2., np.nan, 6.],
                    'c': range(2, 18, 4)})
df2 = pd.DataFrame({'a': [5., 4., np.nan, 3., 7.], 
                    'b': [np.nan, 3., 4., 6., 8.]})

display(df1)
display(df2)
df1.combine_first(df2)

     a    b   c
0  1.0  NaN   2
1  NaN  2.0   6
2  5.0  NaN  10
3  NaN  6.0  14

     a    b
0  5.0  NaN
1  4.0  3.0
2  NaN  4.0
3  3.0  6.0
4  7.0  8.0

     a    b     c
0  1.0  NaN   2.0
1  4.0  2.0   6.0
2  5.0  4.0  10.0
3  3.0  6.0  14.0
4  7.0  8.0   NaN